Барбершоп/src/DataProcessors/ЖурналЗаписей/ЖурналЗаписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЖурналЗаписей</name>
</mdclass:DataProcessor>

Барбершоп/src/AccumulationRegisters/Деньги/Деньги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Деньги</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>EnumRef.ТипДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Барбершоп/src/Documents/Записи/Записи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Записи</name>
  <registerRecords>InformationRegister.ИсторияЗаписей</registerRecords>
  <attributes>
    <name>Салоны</name>
    <type>
      <types>CatalogRef.Салоны</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Document>

Барбершоп/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСотрудника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Барбершоп/src/DataProcessors/ЖурналЗаписей/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = ТекущаяДата();
	Салон = Справочники.Салоны.ОсновнойСалон();
	ОбновитьПериодОтображенияПланировщика();
	СоздатьИзмеренияПланировщика(); 
	ЗаполнитьЖурналЗаписей();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Изменение_Запись" Тогда
		ЗаполнитьЖурналЗаписей();	
	КонецЕсли;
КонецПроцедуры



#КонецОбласти                   



#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновитьПериодОтображенияПланировщика();
	ЗаполнитьЖурналЗаписей()
КонецПроцедуры

&НаКлиенте
Процедура СалонПриИзменении(Элемент)
	ОбновитьПериодОтображенияПланировщика();
	ЗаполнитьЖурналЗаписей()
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = Новый Структура;
	
	ЗначенияЗаполнения.Вставить("Салоны",Салон);
	ЗначенияЗаполнения.Вставить("Дата",Начало);
	ЗначенияЗаполнения.Вставить("ДатаОкончания",Конец);
	ЗначенияЗаполнения.Вставить("Сотрудник",ЗначенияИзмерений["Сотрудник"]);
	
	СтруктураПараметров  = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.Записи.ФормаОбъекта", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыделенныеЭлементы = Элемент.ВыделенныеЭлементы;
	
	ЭлементПланировщика = ВыделенныеЭлементы[0]; 
	
	СтруктураПараметров = Новый Структура("Ключ", ЭлементПланировщика.Значение);
	ОткрытьФорму("Документ.Записи.ФормаОбъекта",СтруктураПараметров);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	
	ВыделенныеЭлементы = Элемент.ВыделенныеЭлементы;
	
	ЭлементПланировщика = ВыделенныеЭлементы[0];
	
	ЗначенияРеквизитов = Новый Структура;
	
	ЗначенияРеквизитов.Вставить("Салоны",Салон);
	ЗначенияРеквизитов.Вставить("Дата",ЭлементПланировщика.Начало);
	ЗначенияРеквизитов.Вставить("ДатаОкончания",ЭлементПланировщика.Конец);
	ЗначенияРеквизитов.Вставить("Сотрудник",ЭлементПланировщика.ЗначенияИзмерений["Сотрудник"]);
	
	
	ОбновитьДанныеЗаписи(ЭлементПланировщика.Значение,ЗначенияРеквизитов)
	
	
КонецПроцедуры  


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПериодОтображенияПланировщика()
	Начало = НачалоДня(Дата) + 9 * 60 * 60;
	Конец  = НачалоДня(Дата) + 19 * 60 * 60;
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Добавить(Начало,Конец);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьИзмеренияПланировщика()
	Измерение = Планировщик.Измерения.Добавить("Сотрудник");
	
	Выборка = Справочники.Сотрудники.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеИзмерения = Измерение.Элементы.Добавить(Выборка.Ссылка);
		
		ЗначениеИзмерения.Текст = Выборка.Наименование + Символы.ПС + Выборка.Должность;
		ЗначениеИзмерения.ЦветРамки = WebЦвета.Синий;
		
	КонецЦикла;
	
КонецПроцедуры   

&НаСервере
Процедура ОбновитьПериодОтображения()
	Начало = НачалоДня(Дата) + 9 * 3600;
	Конец  = КонецДня(Дата) + 9 * 3600;   
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Добавить(Начало,Конец);
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьЖурналЗаписей()
	
	Планировщик.Элементы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Записи.Дата КАК Дата,
	|	Записи.Салоны КАК Салоны,
	|	Записи.Сотрудник КАК Сотрудник,
	|	Записи.Длительность КАК Длительность,
	|	ПРЕДСТАВЛЕНИЕ(Записи.Услуга) КАК Услуга,
	|	Записи.Сумма КАК Сумма,
	|	Записи.ДатаОкончания КАК ДатаОкончания,
	|	Записи.Комментарий КАК Комментарий,
	|	Записи.Ссылка КАК Ссылка,
	|	Записи.Клиент.Телефон КАК Телефон,
	|	Записи.Клиент КАК Клиент,
	|	Записи.Цвет КАК Цвет
	|ИЗ
	|	Документ.Записи КАК Записи
	|ГДЕ
	|	Записи.Проведен
	|	И Записи.Салоны = &Салон
	|	И Записи.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания"; 
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));
	
	Запрос.УстановитьПараметр("Салон", Салон);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЗначениеИзмерений = Новый Соответствие;
			ЗначениеИзмерений.Вставить("Сотрудник",Выборка.Сотрудник);
			
			ЖирныйШрифт = Новый Шрифт(,,Истина);
			
			МассивСтрок = Новый Массив;
			ПредставлениеКлиента  = Строка(выборка.Клиент) + ", " + Выборка.Телефон;
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ПредставлениеКлиента,ЖирныйШрифт));
			МассивСтрок.Добавить(Символы.ПС);
			МассивСтрок.Добавить(Выборка.Услуга);
			МассивСтрок.Добавить(Символы.ПС); 
			Если ЗначениеЗаполнено(Выборка.Комментарий) Тогда
				МассивСтрок.Добавить("--" + Выборка.Комментарий);
			КонецЕсли;
			
			ТекстЭлемента = Новый ФорматированнаяСтрока(МассивСтрок);
			
			ЭлементПланировщика = Планировщик.Элементы.Добавить(Выборка.Дата, выборка.ДатаОкончания);
			ЭлементПланировщика.ЗначенияИзмерений = Новый ФиксированноеСоответствие(ЗначениеИзмерений);
			ЭлементПланировщика.Значение = Выборка.Ссылка;
			ЭлементПланировщика.Текст = ТекстЭлемента;  
			Цвет = Выборка.Цвет.Получить();
			Если Цвет = Неопределено Тогда
				ЭлементПланировщика.ЦветФона = WebЦвета.БледноЛиловый; 	
			Иначе
				ЭлементПланировщика.ЦветФона = Цвет;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьДиаграмму();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграмму()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДеньгиОбороты.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ДеньгиОбороты.СуммаПриход КАК СуммаПриход
	|ИЗ
	|	РегистрНакопления.Деньги.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ДеньгиОбороты";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.АвтоТранспонирование = Ложь;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Точка = Диаграмма.Точки.Добавить("");
	
	Пока Выборка.Следующий() Цикл
		Серия = Диаграмма.Серии.Добавить(Строка(ВЫборка.ТипДенежныхСредств));			
		Диаграмма.УстановитьЗначение(Точка,Серия,Выборка.СуммаПриход);
	КонецЦикла;
	
	Диаграмма.АвтоТранспонирование = Истина;
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьДанныеЗаписи(Запись,ЗначенияРеквизитов)
	
	ОбъектЗаписи = Запись.ПолучитьОбъект();
	
	ЕстьИзменения = Ложь;
	Для каждого Реквизит из ЗначенияРеквизитов Цикл
		Если ОбъектЗаписи[Реквизит.Ключ] <> Реквизит.Значение Тогда
			ЕстьИзменения = Истина;
			Прервать;	
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьИзменения Тогда
		ЗаполнитьЗначенияСвойств(ОбъектЗаписи,ЗначенияРеквизитов);
		Длительность = (ОбъектЗаписи.ДатаОкончания - ОбъектЗаписи.Дата)/60;
		ОбъектЗаписи.Длительность = Длительность;
		
		ОбъектЗаписи.Записать();
	КонецЕсли;                                                    
	
КонецПроцедуры

#КонецОбласти
